** Frames as the Repository of Local State

We can turn to the environment model to see how procedures and assignment can be used to represent objects with local state.

Consider the withdrawl processor: 

#+BEGIN_SRC scheme
(define (make-withdraw balance)
  (lambda (amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient Funds")))

(define w1 (make-withdraw 100))
#+END_SRC

#+BEGIN_SRC scheme
(w1 50)
#+END_SRC

#+RESULTS:
: 0

#+BEGIN_SRC scheme
(define w2 (make-withdraw 100))
#+END_SRC

